[
  {
    "id": "follow_me",
    "title": {
      "en": "Follow me on Twitter",
      "es": "Sígueme en Twitter",
      "ar": "تابعني على تويتر",
      "tr": "Twitter'da beni takip edin",
      "fr": "Suis moi sur Twitter",
      "ru": "Подпишитесь на меня в Twitter",
      "it": "Seguimi su Twitter",
      "de": "Folge mir auf Twitter"
    },
    "message": {
      "en": "Follow me on Twitter where I post information regarding new features and updates coming to School Planner.",
      "es": "Sígueme en Twitter, donde publico información sobre las nuevas funciones y actualizaciones de School Planner.",
      "ar": "قم بمتابعتي على تويتر حيث أقوم بنشر أخبار عن آخر الميزات والتحديثات في تطبيق مخطط المدرسة.",
      "tr": "School Planner'a gelen yeni özellikler ve güncellemeler hakkında bilgi yayınladığım Twitter'da beni takip edin.",
      "fr": "Suivez-moi sur Twitter où je publie des informations sur les nouvelles fonctionnalités et les mises à jour à venir pour School Planner.",
      "ru": "Подписывайтесь на меня в Twitter, где я публикую информацию о новых функциях и обновлениях для School Planner.",
      "it": "Seguimi su Twitter dove pubblico informazioni sulle nuove funzionalità e aggiornamenti in arrivo su School Planner.",
      "de": "Folgen Sie mir auf Twitter, wo ich Informationen über neue Funktionen und Updates für den School Planner poste."
    },
    "action": {
      "en": "Follow",
      "es": "Seguir",
      "ar": "متابعة",
      "tr": "Takip",
      "fr": "Suivre",
      "ru": "Подписаться",
      "it": "Segui",
      "de": "Folgen"
    },
    "dismiss": null,
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/follow_me.webp",
    "actionUrl": "https://twitter.com/heysem_k",
    "endDate": null,
    "runTimes": 54,
    "versionCode": null
  },
  {
    "id": "help_translating",
    "title": {
      "en": "Help Translating",
      "es": "Ayuda para traducir",
      "ar": "ساهم بترجمة التطبيق",
      "tr": "Çeviri Yardımı",
      "fr": "Aide à la traduction",
      "ru": "Помощь в переводе",
      "it": "Aiuto nella traduzione",
      "de": "Hilfe beim Übersetzen"
    },
    "message": {
      "en": "Would you like to see School Planner in your language?\nPlease help translate the app or review and correct current translations.",
      "es": "¿Le gustaría ver School Planner en su idioma?\nAyude a traducir la aplicación o revise y corrija las traducciones actuales.",
      "ar": "هل ترغب برؤية مخطط المدرسة بلغتك؟\nالرجاء المساعدة في ترجمة التطبيق أو مراجعة وتصحيح الترجمات الحالية.",
      "tr": "School Planner'ı kendi dilinizde görmek ister misiniz?\nLütfen uygulamanın çevirisine yardımcı olun veya mevcut çevirileri gözden geçirip düzeltin.",
      "fr": "Aimeriez-vous voir School Planner dans votre langue?\nS'il vous plaît aider à traduire l'application ou revoir et corriger les traductions actuelles.",
      "ru": "Хотели бы вы видеть School Planner на вашем языке?\nПожалуйста, помогите перевести приложение или проверьте и исправьте текущие переводы.",
      "it": "Ti piacerebbe vedere School Planner nella tua lingua?\nAiuta a tradurre l'app o a rivedere e correggere le traduzioni attuali.",
      "de": "Möchten Sie den School Planner in Ihrer Sprache sehen?\nBitte helfen Sie bei der Übersetzung der App oder überprüfen und korrigieren Sie aktuelle Übersetzungen."
    },
    "action": {
      "en": "Participate",
      "es": "Unirse",
      "ar": "حسناً",
      "tr": "Katılın",
      "fr": "Rejoindre",
      "ru": "Участвовать",
      "it": "Partecipa",
      "de": "Teilnehmen"
    },
    "dismiss": null,
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/translate_app.webp",
    "actionUrl": "https://localazy.com/p/school-planner",
    "endDate": null,
    "runTimes": 36,
    "versionCode": null
  },
  {
    "id": "new_avatars",
    "title": {
      "en": "Introducing Avatars",
      "es": "Presentando Avatares",
      "ar": "نقدم لكم ميزة الصور الرمزية",
      "tr": "Avatarları Tanıtıyoruz",
      "fr": "Introduction des Avatars",
      "ru": "Представляем Аватары",
      "it": "Introduzione degli Avatar",
      "de": "Vorstellung von Avataren"
    },
    "message": {
      "en": "Explore the new awesome avatar collection! Choose a unique avatar for yourself or for your teachers. Try it now by going to your profile or teachers screen.",
      "es": "¡Explora la increíble nueva colección de avatares! Elige un avatar único para ti o para tus profesores. Pruébalo ahora yendo a tu perfil o a la pantalla de profesores.",
      "ar": "اكتشف مجموعة الصور الرمزية الجديدة والرائعة! اختر صورة رمزية فريدة لك أو لمعلميك. جربه الآن عن طريق الانتقال إلى ملفك الشخصي أو شاشة المعلمين.",
      "tr": "Yeni ve harika avatar koleksiyonunu keşfedin! Kendiniz veya öğretmenleriniz için benzersiz bir avatar seçin. Şimdi profilinize veya öğretmenler ekranına giderek deneyin.",
      "fr": "Découvrez la nouvelle collection d'avatars géniaux! Choisissez un avatar unique pour vous ou pour vos professeurs. Essayez-le maintenant en allant sur votre profil ou sur l'écran des enseignants.",
      "ru": "Исследуйте новую потрясающую коллекцию аватаров! Выберите уникальный аватар для себя или для ваших учителей. Попробуйте сейчас, перейдя в свой профиль или на экран учителей.",
      "it": "Scopri la nuova fantastica collezione di avatar! Scegli un avatar unico per te o per i tuoi insegnanti. Provalo ora andando sul tuo profilo o sulla schermata degli insegnanti.",
      "de": "Entdecken Sie die neue beeindruckende Avatar-Sammlung! Wählen Sie einen einzigartigen Avatar für sich selbst oder für Ihre Lehrer aus. Probieren Sie es jetzt aus, indem Sie zu Ihrem Profil oder zum Lehrerbildschirm gehen."
    },
    "action": null,
    "dismiss": {
      "en": "Got it",
      "es": "Entendido",
      "ar": "حسناً",
      "tr": "Anladım",
      "fr": "Compris",
      "ru": "Понял",
      "it": "Capito",
      "de": "Verstanden"
    },
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/new_avatars.webp",
    "actionUrl": null,
    "endDate": 1698105600,
    "runTimes": 72,
    "versionCode": 140
  },
  {
    "id": "web_app",
    "title": {
      "en": "School Planner for Web",
      "es": "Agenda Escolar para web",
      "ar": "مخطط الدراسة للويب",
      "tr": "Web için Okul Planlayıcısı",
      "fr": "School Planner pour le Web",
      "ru": "School Planner для Веба",
      "it": "School Planner per il Web",
      "de": "School Planner für das Web"
    },
    "message": {
      "en": "Introducing School planner for web. You can now view and update your schedule on your computer with our new web app.",
      "es": "Presentamos School Planner para web. Ahora puedes ver y actualizar tu horario en tu computadora con nuestra nueva aplicación web.",
      "ar": "نقدم لكم مخطط الدراسة للويب. يمكنك الآن عرض وتحديث جدولك الدراسي على الكمبيوتر من خلال تطبيقنا الويب الجديد.",
      "tr": "Web için School Planner'ı tanıtıyoruz. Artık yeni web uygulamamızla bilgisayarınızda programınızı görüntüleyebilir ve güncelleyebilirsiniz.",
      "fr": "Introduction de School Planner pour le web. Vous pouvez désormais voir et mettre à jour votre emploi du temps sur votre ordinateur avec notre nouvelle application web.",
      "ru": "Представляем School Planner для веба. Теперь вы можете просматривать и обновлять свое расписание на компьютере с помощью нашего нового веб-приложения.",
      "it": "Introduciamo School Planner per il web. Ora puoi visualizzare e aggiornare il tuo orario sul computer con la nostra nuova app web.",
      "de": "Wir stellen School Planner für das Web vor. Sie können jetzt Ihren Zeitplan auf Ihrem Computer mit unserer neuen Web-App anzeigen und aktualisieren."
    },
    "action": {
      "en": "Try It",
      "es": "Pruébalo",
      "ar": "جربه الآن",
      "tr": "Dene",
      "fr": "Essayez-le",
      "ru": "Попробуйте",
      "it": "Provalo",
      "de": "Versuchen Sie es"
    },
    "dismiss": null,
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/web_app.webp",
    "actionUrl": "https://app.schoolplanner.me",
    "endDate": null,
    "runTimes": 14,
    "versionCode": null
  },
  {
    "id": "create_account",
    "title": {
      "en": "Create an Account",
      "es": "Crea una Cuenta",
      "ar": "إنشاء حساب",
      "tr": "Hesap Oluştur",
      "fr": "Créer un Compte",
      "ru": "Создать Аккаунт",
      "it": "Crea un Account",
      "de": "Konto Erstellen"
    },
    "message": {
      "en": "If you haven't already, consider creating a new account. This not only helps in recovering your data in case of a phone upgrade or app data deletion but also allows access on other devices and the web. And no need to worry about your current data; when you create an account, everything you have will automatically move to your new account.",
      "es": "Si aún no lo has hecho, considera crear una nueva cuenta. Esto no solo ayuda a recuperar tus datos en caso de una actualización de teléfono o eliminación de datos de la aplicación, sino que también permite el acceso en otros dispositivos y en la web. Y no te preocupes por tus datos actuales; cuando crees una cuenta, todo lo que tienes se moverá automáticamente a tu nueva cuenta.",
      "ar": "إذا لم تكن قد فعلت ذلك بالفعل، فكر في إنشاء حساب جديد. هذا لا يساعد فقط في استعادة بياناتك في حالة ترقية الهاتف أو حذف بيانات التطبيق، ولكن يسمح أيضًا بالوصول على أجهزة أخرى وعلى الويب. ولا داعي للقلق بشأن بياناتك الحالية؛ عند إنشاء حساب، سيتم نقل كل ما لديك تلقائيًا إلى حسابك الجديد.",
      "tr": "Henüz yapmadıysanız, yeni bir hesap oluşturmayı düşünün. Bu, telefonunuzu yükseltmeniz veya uygulama verilerini silmeniz durumunda verilerinizi kurtarmanıza yardımcı olmanın yanı sıra, diğer cihazlarda ve web üzerinde erişim sağlar. Mevcut verileriniz konusunda endişelenmenize gerek yok; bir hesap oluşturduğunuzda, sahip olduğunuz her şey otomatik olarak yeni hesabınıza taşınacaktır.",
      "fr": "Si vous ne l'avez pas déjà fait, envisagez de créer un nouveau compte. Cela aide non seulement à récupérer vos données en cas de mise à niveau de téléphone ou de suppression de données d'application, mais permet également un accès sur d'autres appareils et sur le web. Et pas besoin de vous inquiéter de vos données actuelles ; lorsque vous créez un compte, tout ce que vous avez sera automatiquement transféré vers votre nouveau compte.",
      "ru": "Если вы еще этого не сделали, подумайте о создании нового аккаунта. Это не только поможет восстановить ваши данные в случае обновления телефона или удаления данных приложения, но и позволит получить доступ к ним на других устройствах и в Интернете. И не беспокойтесь о своих текущих данных; когда вы создаете аккаунт, все, что у вас есть, автоматически перенесется в ваш новый аккаунт.",
      "it": "Se non l'hai già fatto, prendi in considerazione la creazione di un nuovo account. Questo non solo aiuta nel recupero dei tuoi dati in caso di aggiornamento del telefono o cancellazione dei dati dell'app, ma consente anche l'accesso su altri dispositivi e sul web. E non devi preoccuparti dei tuoi dati attuali; quando crei un account, tutto ciò che hai si sposterà automaticamente sul tuo nuovo account.",
      "de": "Wenn Sie es noch nicht getan haben, erwägen Sie die Erstellung eines neuen Kontos. Dies hilft nicht nur dabei, Ihre Daten im Falle eines Telefon-Upgrades oder einer App-Datenlöschung wiederherzustellen, sondern ermöglicht auch den Zugriff auf anderen Geräten und im Web. Und keine Sorge um Ihre aktuellen Daten; wenn Sie ein Konto erstellen, wird alles, was Sie haben, automatisch auf Ihr neues Konto übertragen."
    },
    "action": {
      "en": "Register",
      "es": "Registrarse",
      "ar": "تسجيل",
      "tr": "Kaydol",
      "fr": "S'inscrire",
      "ru": "Регистрация",
      "it": "Registrati",
      "de": "Registrieren"
    },
    "actionCustom": "create_account",
    "dismiss": null,
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/create_account.webp",
    "actionUrl": null,
    "endDate": null,
    "runTimes": 14,
    "versionCode": null
  },
  {
    "id": "attendance",
    "title": {
      "en": "Attendance Feature",
      "es": "Función de Asistencia",
      "ar": "ميزة الحضور",
      "tr": "Katılım Özelliği",
      "fr": "Fonction de Présence",
      "ru": "Функция Посещаемости",
      "it": "Funzione di Presenza",
      "de": "Anwesenheitsfunktion"
    },
    "message": {
      "en": "Now you can track your attendance in school. Just mark a day or a class as \"Absent\" or \"Late\" and the app will keep track on your behalf. You can also set limits for allowed absence.",
      "es": "Ahora puedes hacer un seguimiento de tu asistencia en la escuela. Simplemente marca un día o una clase como \"Ausente\" o \"Tarde\" y la aplicación llevará el registro en tu nombre. También puedes establecer límites para las ausencias permitidas.",
      "ar": "يمكنك الآن تتبع حضورك في المدرسة. فقط علم يومًا أو فصلًا دراسيًا على أنه \"غائب\" أو \"متأخر\" وسيتابع التطبيق الحضور نيابةً عنك. يمكنك أيضًا تحديد حدود للغياب المسموح به.",
      "tr": "Artık okuldaki katılımınızı takip edebilirsiniz. Sadece bir günü veya dersi \"Devamsız\" veya \"Geç\" olarak işaretleyin ve uygulama sizin adınıza takip edecektir. İzin verilen devamsızlık için sınırlar da belirleyebilirsiniz.",
      "fr": "Vous pouvez désormais suivre votre présence à l'école. Il suffit de marquer un jour ou un cours comme \"Absent\" ou \"En retard\" et l'application tiendra le compte en votre nom. Vous pouvez également définir des limites pour l'absence autorisée.",
      "ru": "Теперь вы можете отслеживать свою посещаемость в школе. Просто отметьте день или урок как \"Отсутствующий\" или \"Опоздавший\", и приложение будет вести учет за вас. Вы также можете установить пределы для разрешенного отсутствия.",
      "it": "Ora puoi monitorare la tua presenza a scuola. Basta segnare un giorno o una lezione come \"Assente\" o \"In ritardo\" e l'app terrà traccia per tuo conto. Puoi anche impostare limiti per l'assenza consentita.",
      "de": "Jetzt können Sie Ihre Anwesenheit in der Schule verfolgen. Markieren Sie einfach einen Tag oder eine Klasse als \"Abwesend\" oder \"Verspätet\" und die App wird für Sie Buch führen. Sie können auch Grenzen für erlaubte Abwesenheiten festlegen."
    },
    "action": null,
    "dismiss": null,
    "imageUrl": "https://raw.githubusercontent.com/swazer-lab/schoolplanner/main/announcement_images/attendance.webp",
    "actionUrl": null,
    "endDate": 1705104000,
    "runTimes": 54,
    "versionCode": 152
  }
]